#-*- coding=utf8 -*-
#组队探宝配置
#explore config

#发起组队需要的DefinitionId
EXPLORE_NEED_PROPID = '10090'
#玩小游戏需要的DefinitionId
LITTLEGAME_NEED_PROPID = '10080'

EXPLORE_CONFIG = {
    #第1层，3个阶段
    1:{
        1:{
            'score':20000,
            'reward':1
        },
        2:{
            'score':50000,
            'reward':2
        },
        3:{
            'score':100000,
            'reward':3
        }
    },
    2:{
        1:{
            'score':20000,
            'reward':4
        },
        2:{
            'score':50000,
            'reward':5
        },
        3:{
            'score':100000,
            'reward':6
        }
    },
    3:{
        1:{
            'score':20000,
            'reward':1
        },
        2:{
            'score':50000,
            'reward':2
        },
        3:{
            'score':100000,
            'reward':3
        }
    },
    
}

#奖励配置
EXPLORE_REWARD_CONFIG = {
    1:[14001900,14001910,14001920,14001930,14001940,14002001,14002011],
    2:[13002102,13002112,14002021,14002031,14002041,14002102,14002112],
    3:[13002122,13002132,13002142,14002122,14002132,14002142],
    4:[14002200,14002210,14002220,14002230,14002240,14002301,14002311],
    5:[13002202,13002212,14002321,14002331,14002341,14002402,14002412],
    6:[13002222,13002232,13002242,14002422,14002432,14002442],
}

#挖一个获得的奖励
EXPLORE_DIG_REWARD_CONFIG = {
    1:[
    {'relative_odds':88,'num':5,'value':[2]},
    {'relative_odds':8,'num':1,'value':[4]},
    {'relative_odds':4,'num':1,'value':[10080]},
    ],
}


